uhnp/src/Enums/ВидыДеятельностиДляНалоговогоУчетаЗатрат/ВидыДеятельностиДляНалоговогоУчетаЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДеятельностиДляНалоговогоУчетаЗатрат</name>
  <enumValues>
    <name>ОсновнаяСистемаНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>ОсобыйПорядокНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>РаспределяемыеЗатраты</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыПрочихДоходовИРасходов/ВидыПрочихДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрочихДоходовИРасходов</name>
  <enumValues>
    <name>БезвозмездноеПолучениеИмуществаРаботУслугИмущественныхПрав</name>
  </enumValues>
  <enumValues>
    <name>ВозмещениеУбытковКПолучениюУплате</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеАмортизационнойПремии</name>
  </enumValues>
  <enumValues>
    <name>ДолевоеУчастиеВИностранныхОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ДолевоеУчастиеВРоссийскихОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ИзлишкиПриИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПрибылиДоРыночныхЦен</name>
  </enumValues>
  <enumValues>
    <name>КурсовыеРазницы</name>
  </enumValues>
  <enumValues>
    <name>КурсовыеРазницыПоРасчетамВУЕ</name>
    <comment>Курсовые разницы по расчетам в у.е.</comment>
  </enumValues>
  <enumValues>
    <name>ЛиквидацияОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>НалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>НДСПоСписаннойКредиторскойЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>ОперацииСФинансовымиИнструментамиСрочныхСделок</name>
  </enumValues>
  <enumValues>
    <name>ОперацииСФинансовымиИнструментамиСрочныхСделокОР</name>
  </enumValues>
  <enumValues>
    <name>ОтчисленияВОценочныеРезервы</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>ПремияПокупателю</name>
    <comment>Премия, выплаченная покупателю</comment>
  </enumValues>
  <enumValues>
    <name>ПрибыльУбытокПрошлыхЛет</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыКПолучениюУплате</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыНачисленныеПоСт269</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоГосударственнымЦеннымБумагам</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнереализационныеДоходыРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеКосвенныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеДоходыРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеУбыткиПриравненныеКВнереализационнымРасходам</name>
  </enumValues>
  <enumValues>
    <name>РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаУслугиБанков</name>
  </enumValues>
  <enumValues>
    <name>РасходыОтСниженияСтоимостиАктивов</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>РеализацияИмущественныхПравКромеПраваТребования</name>
  </enumValues>
  <enumValues>
    <name>РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств</name>
  </enumValues>
  <enumValues>
    <name>РеализацияНематериальныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>РеализацияОбъектовСтроительства</name>
  </enumValues>
  <enumValues>
    <name>РеализацияОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РеализацияПраваТребованияДоНаступленияСрокаПлатежа</name>
  </enumValues>
  <enumValues>
    <name>РеализацияПраваТребованияКакОказанияФинансовыхУслуг</name>
  </enumValues>
  <enumValues>
    <name>РеализацияПраваТребованияПослеНаступленияСрокаПлатежа</name>
  </enumValues>
  <enumValues>
    <name>РеализацияПрочегоИмущества</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЦенныхБумаг</name>
  </enumValues>
  <enumValues>
    <name>СдачаИмуществаВАрендуИлиСубаренду</name>
  </enumValues>
  <enumValues>
    <name>СписаниеДебиторскойКредиторскойЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УчастиеВДругихОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ШтрафыПениНеустойкиКПолучениюУплате</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыКПолучению</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыКУплате</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/НалоговыйУчетПовтИсп/Module.bsl
Функция ВидДоходовРасходовУчитывается(ВидДоходовРасходов) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидДоходовРасходов) Тогда
		Возврат Истина;
	КонецЕсли;
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ВидДоходовРасходов,
		"ЭтоГруппа,ВидДеятельностиДляНалоговогоУчетаЗатрат,ПринятиеКНалоговомуУчету");
	
	Если РеквизитыОбъекта.ЭтоГруппа Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РеквизитыОбъекта.ВидДеятельностиДляНалоговогоУчетаЗатрат <> Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат РеквизитыОбъекта.ПринятиеКНалоговомуУчету;
	
КонецФункции

Функция СтатьяЗатратУчитывается(СтатьяЗатрат) Экспорт
	
	ТипСтатьиРасходов = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов");
	Если НЕ (ЗначениеЗаполнено(СтатьяЗатрат) И ТипЗнч(СтатьяЗатрат) = ТипСтатьиРасходов) Тогда
		Возврат Истина;
	КонецЕсли;
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СтатьяЗатрат,
		"ЭтоГруппа,ВидДеятельностиДляНалоговогоУчетаЗатрат,ПринятиеКНалоговомуУчету");
	
	Если РеквизитыОбъекта.ЭтоГруппа Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РеквизитыОбъекта.ВидДеятельностиДляНалоговогоУчетаЗатрат <> Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат РеквизитыОбъекта.ПринятиеКНалоговомуУчету;
	
КонецФункции

Функция ЭтоСтатьяВнереалиационныхРасходов(СтатьяРасходов) Экспорт
	
	СвойстваСтатьи =  ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяРасходов, "ЭтоГруппа, ВидПрочихДоходовИРасходов");
	
	Возврат (НЕ СвойстваСтатьи.ЭтоГруппа 
				И СвойстваСтатьи.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы);
	
	
КонецФункции

Функция ЭтоСтатьяВнереалиационныхДоходов(СтатьяДоходов) Экспорт
	
	СвойстваСтатьи =  ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяДоходов, "ЭтоГруппа, ВидПрочихДоходовИРасходов");
	
	Возврат (НЕ СвойстваСтатьи.ЭтоГруппа 
				И СвойстваСтатьи.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы);
	
КонецФункции
